# This file should contain all the record creation needed to seed
# the database with its default values.
# The data can then be loaded with the rake db:seed
# (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)

# Table name: pages
#
#  id         :integer          not null, primary key
#  path       :string
#  text       :text
#  created_at :datetime         not null
#  updated_at :datetime         not null
#  task_id    :integer
task1 = Task.new
task1.status = 2
task1.stage = 0
task1.created_at = DateTime.now
task1.part = 1
task1.save

task2 = Task.new
task2.status = 2
task2.stage = 1
task2.created_at = DateTime.now
task2.part = 1
task2.save

task3 = Task.new
task3.status = 2
task3.stage = 1
task3.created_at = DateTime.now
task3.part = 2
task3.save

page1 = Page.new
page1.text = "Перш за все, слід розрізняти три послідовних рукописи, написаних
  за планами, які змінюють структуру та визначення проблем, які досліджено в 
  кожній наступній версії; та три редакції Капіталу.[2]

  Перший рукопис на економічну тему: Основи критики політичної 
  економії (нім. Grundrisse der Kritik der politischen Ökonomie, 
  1857–1858). Був першим загальним нарисом запланованої праці, 
  оснований на ідеї системного розвитку від абстрактних понять до 
  конкретного, з прозорим поясненням виконаних кроків. Особливо це 
  стосується поняття вартості, визначення ціни та собівартості виробництва, 
  завдяки чому Маркс вивільнився з поняттєвого простору Рікардо. 
  В цьому рукописі містилась лише частина більшої праці, яку запланував 
  на цей час Маркс. Однак в ньому покривались, хоча і нерівномірно, 
  частини майбутнього Капіталу, а другий та третій томи все ще перебували в 
  зародковому стані. Роботу над ним було завершено в січні 1858 року.

  Маркс одразу ж взявся за написання та друк До критики політичної економії 
  (нім. Zur Kritik der politischen Ökonomie, 1859) яка згодом перетворилась 
  на першу частину першого тому, присвячену основним категоріям товарів та 
  грошам.

  Того ж року, він окреслив нарис праці, яка б складалась з трьох томів, 
  які ми знаємо зараз, та окреслив зміст розділів першого тому.

  Другий рукопис на економічну тему (від грудня 1861 до липня 1863) містив:

  варіант першого тому (продовження До критики);
  варіант третього тому;
  Теорії доданої вартості, на яких було заплановано побудувати четвертий том, 
  присвячений історії та критиці попередньої економічної теорії."
page1.created_at = DateTime.now
page1.task_id = Task.last.id - 1
page1.path = "public/assets/1-5443c1b08364dad62e3ec7e3e2a351a695e004040b9fa603647aa6b22d0d4163.png"
page1.status = 0
page1.save

page2 = Page.new
page2.text = "Цей рукопис містить новий та дуже докладний план першого та 
третього томів, написаних після Теорій в січні 1863 року, та 
відображає теоретичні вдосконалення, які вони містили, 
особливо поняття «капіталу взагалі», яке має основну роль в праці.

  Третій рукопис на економічну тематику (1863–1865) являє собою нову, 
  попередню чернетку, трьох томів. Він також містить важливий текст, 
  який було заплановано розмістити в кінці першого тому, але його було
  вирішено пропустити. Він має назву «Глава 6. 
  Наслідки безпосереднього процесу виробництва».

  Також існують три редакції першого тому Капіталу. 
  Перша редакція (1867) відрізняється від наступних відмінним змістом першої
    глави та наявністю «додатку» з альтернативним вмістом. Друга німецька 
    редакція (1873) в якій перша глава основана на додатку попердньої редакції. 
    Французька редакція (1872–1875) побачила світ в окремих випусках, 
    перекладач Дж. Рой, відредагована Марксом, який скористався цією нагодою 
    аби підправити текст в багатьох місцях.

Наступні редакції були підготовлені Енгельсом. Четверте видання, 
яке стало «канонічним текстом», в основному спирається на друге 
німецьке видання з деякими додатками, 
які Маркс написав для французького видання."
page2.created_at = DateTime.now
page2.task_id = Task.last.id - 1
page2.path = "public/assets/2-e96360829717ad253b15ab11ef0b4331cfa1fb15c89588137d64aecc132079e1.png"
page2.status = 1
page2.save

page3 = Page.new
page3.text = "Передмови[ред. • ред. код]
Промислово розвиненіша країна показує менш розвиненій країні лише 
картину її власної будучини[6].

Діялектика в нього [ Геґеля ] стоїть на голові. Треба її повернути
 й поставити на ноги, щоб вилущити раціональне ядро з містичної шкаралупи[7]."
page3.created_at = DateTime.now
page3.task_id = Task.last.id - 1
page3.path = "public/assets/3-e96360829717ad253b15ab11ef0b4331cfa1fb15c89588137d64aecc132079e1.png"
page3.status = 1
page3.save

page4 = Page.new
page4.text = "Відділ перший. Товар і гроші[ред. • ред. код]
Отже, праця не є однісіньке джерело продукованих нею споживчих вартостей, 
речового багатства. Праця є його батько, як каже Вільям Петті, 
а земля — його матір[8].

...таємність товарової форми є попросту в тому, що форма ця відбиває 
людям суспільний характер їхньої власної праці як предметний характер 
самих продуктів праці, як суспільні природні властивості цих речей; 
тим то й суспільне відношення продуцентів всієї сукупної праці вона 
відбиває як суспільне відношення предметів, яке існує поза ними[9].

Вони несвідомі цього, але вони це роблять[10].

Величини вартостей змінюються постійно незалежно від волі, передбачення
  й діяльности осіб, що обмінюють продукти. Власний суспільний рух цих 
  осіб має в їхніх очах форму руху речей, під контролем якого вони стоять 
  замість самим його контролювати[11]."
page4.created_at = DateTime.now
page4.task_id = Task.last.id
page4.path = "public/assets/4-e96360829717ad253b15ab11ef0b4331cfa1fb15c89588137d64aecc132079e1.png"
page4.status = 0
page4.save

page5 = Page.new
page5.text = "Відділ перший. Товар і гроші[ред. • ред. код]
Отже, праця не є однісіньке джерело продукованих нею споживчих вартостей, 
речового багатства. Праця є його батько, як каже Вільям Петті, 
а земля — його матір[8].

...таємність товарової форми є попросту в тому, що форма ця відбиває 
людям суспільний характер їхньої власної праці як предметний характер 
самих продуктів праці, як суспільні природні властивості цих речей; 
тим то й суспільне відношення продуцентів всієї сукупної праці вона 
відбиває як суспільне відношення предметів, яке існує поза ними[9].

Вони несвідомі цього, але вони це роблять[10].

Величини вартостей змінюються постійно незалежно від волі, передбачення
  й діяльности осіб, що обмінюють продукти. Власний суспільний рух цих 
  осіб має в їхніх очах форму руху речей, під контролем якого вони стоять 
  замість самим його контролювати[11]."
page5.created_at = DateTime.now
page5.task_id = Task.last.id
page5.path = "public/assets/5-e96360829717ad253b15ab11ef0b4331cfa1fb15c89588137d64aecc132079e1.png"
page5.status = 1
page5.save
